/* %1$@ = Make GIF; %2$@ = Take Photo */
"Drag %1$@ after the\n%2$@ action." = "Vedä ”%1$@”\n”%2$@” -toiminnon perään.";

/* %1$@ = Take Photo, %2$@ = “left” or “right” */
"Drag %1$@ to the %2$@." = "Vedä ”%1$@” %2$@.";

/* %1$@ = a localized and formatted number; %2$@ = a unit; e.g “15 kg” */
"%1$@ %2$@" = "%1$@ %2$@";

/* %@ = Quick Look */
"Add %@ to\npreview your GIF." = "Lisää %@\nGIFin esikatselua varten.";

/* %@ = shortcut name */
"Added shortcut: %@" = "Lisättiin oikotie: %@";

/* A message; shortcuts on watch have been reset */
"Your shortcuts have been reset. Re-open the Shortcuts app to continue." = "Oikotiesi on nollattu. Jatka avaamalla Oikotiet-appi uudelleen.";

/* Accessibility hint for today widget shortcut that is not running but will run if you tap on it; %@=shortcut name */
"Runs the shortcut %@" = "Suorittaa oikotien %@";

/* Accessibility hint for today widget shortcut when the shortcut is running; %lu=percentage completed */
"Running, %lu%% complete" = "Suoritetaan, %lu %% valmiina";

/* Accessibility label */
"Edit profile photo" = "Muokkaa profiilikuvaa";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of Notification Center being pulled down from the top of the screen" = "Animaatio Ilmoituskeskuksen vetämisestä alas näytön yläreunasta";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of adding the Shortcuts widget to the list of active widgets" = "Animaatio Oikotiet-widgetin lisäämisestä aktiivisten widgettien luetteloon";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of scrolling to the bottom of the widgets list and tapping Edit" = "Animaatio widgettiluettelon alareunaan vierittämisestä ja Muokkaa-painikkeen painamisesta";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of swiping left to the list of widgets" = "Animaatio pyyhkäisemisestä vasemmalle widgettiluetteloon";

/* Accessibility label in on-boarding flow */
"A screenshot of Notification Center with the Shortcuts widget" = "Näyttökuva Ilmoituskeskuksesta, jossa on Oikotiet-widgetti";

/* Accessibility label. %1$@ = workflow name; %2$@ = workflow short description */
"%1$@, %2$@" = "%1$@, %2$@";

/* Accessibility label; %@ = user’s name */
"%@’s profile picture" = "Käyttäjän %@ profiilikuva";

/* Accessibility label; option (Twitter handle, website, as email) is NOT selected as main identity; tap to make main identity */
"Make main identity" = "Tee pääidentiteetti";

/* Accessibility label; option (Twitter handle, website, as email) is selected as main identity */
"Selected as main identity" = "Valittu pääidentiteetiksi";

/* Accessiblity label; +/- key on number pad */
"Plus, Minus" = "plus, miinus";

/* Accessiblity label; backspace key on number pad */
"Backspace" = "Askelpalautin";

/* Accessiblity label; decimal key on number pad */
"Decimal" = "Desimaali";

/* Action extension; missing input from app error message */
"Unfortunately, there is nothing Shortcuts can do about this; it is due to a bug in the host app. We’d recommend contacting the maker of that app and letting them know of this problem." = "Valitettavasti Oikotiet ei voi tehdä tälle mitään. Ongelma on isäntäapissa. Apple suosittelee, että ilmoitat ongelmasta apin tekijälle.";

/* Action extension; missing input from app error title */
"The app that opened this extension did not provide any input." = "Appi, joka avasi tämän laajennuksen, ei antanut syötettä.";

/* Alert body; importing shortcut failed */
"The shortcut could not be downloaded." = "Oikotietä ei voitu ladata.";

/* Alert message; shortcut on watch has been created by newer version of shortcut and are incompatible */
"The Shortcuts database cannot be read because it was created by a newer version of Shortcuts.\n\nYou can either upgrade Shortcuts or reset your shortcuts. Your shortcuts will be lost, but if you use iCloud Sync they will be restored." = "Oikotiet-tietokantaa ei voida lukea, koska se luotiin uudemmalla Oikotiet-versiolla.\n\nVoit joko päivittää Oikotiet tai nollata oikotiesi. Menetät oikotiesi, mutta jos käytät iCloud-synkronointia, ne palautetaan.";

/* Alert message; shortcuts database on device is corrupt */
"The Shortcuts database cannot be read because it is corrupt. You can fix this by resetting your shortcuts. Your shortcuts will be lost, but if you use iCloud Sync they will be restored." = "Oikotiet-tietokantaa ei voida lukea, koska se on vioittunut. Voit korjata sen nollaamalla oikotiesi. Menetät oikotiesi, mutta jos käytät iCloud-synkronointia, ne palautetaan.";

/* Alert message; shortcuts database on device is corrupt */
"The Shortcuts database cannot be read because it is corrupt.\n\nYou can email support with your corrupted database or reset your custom shortcuts. Your shortcuts will be lost, but if you use iCloud Sync they will be restored." = "Oikotiet-tietokantaa ei voida lukea, koska se on vioittunut.\n\nVoit lähettää vioittuneen tietokannan sähköpostilla tukeen tai nollata muokatut oikotiesi. Menetät oikotiesi, mutta jos käytät iCloud-synkronointia, ne palautetaan.";

/* Alert option to email support; shortcuts database on device is corrupt */
"Email Support" = "Kirjoita tukeen";

/* Alert option to reset shortcuts on device */
"Reset Shortcuts" = "Nollaa oikotiet";

/* Alert option to update the Shortcuts app (opens App Store); shortfut on watch has been created by newer version of shortcut and are incompatible */
"Update Shortcuts" = "Päivitä oikotiet";

/* Alert title for an error */
"Aw no!" = "Voi ei!";

/* Alert title; shortcut on watch has been created by newer version of shortcut and are incompatible */
"Shortcuts Version Mismatch" = "Oikotiet-versio ei täsmää";

/* Alert title; shortcuts on watch have been reset */
"Shortcuts Reset" = "Oikotiet nollattu";

/* Apple watch; label for result from running the shortcut */
"Result" = "Tulos";

/* Apple watch; label for result from running the shortcut when there are multiple results; %ld=number of results */
"Results (%ld)" = "Tulokset (%ld)";

/* Back button */
"Back" = "Takaisin";

/* Body of alert encouraging users to add the Shortcuts widget after they have tried to skip adding the widget. */
"Adding the widget dramatically improves the speed of running shortcuts. Are you sure you’d like to skip this step?" = "Widgetin lisääminen nopeuttaa oikoteiden suorittamista huomattavasti. Ohitetaanko tämä vaihe?";

/* Body of alert when the user’s gallery submission didn’t go through due to an error */
"Your submission didn’t go through! Try again in a few minutes." = "Lähetys ei mennyt läpi! Yritä uudelleen muutaman minuutin päästä.";

/* Button */
"Cancel" = "Kumoa";

/* Button */
"Done" = "Valmis";

/* Button */
"Next" = "Seuraava";

/* Button */
"OK" = "OK";

/* Button */
"Submit your own workflow" = "Lähetä oma työnkulkusi";

/* Button for editing their profile picture */
"Edit" = "Muokkaa";

/* Button or nav bar title */
"Edit Profile" = "Muokkaa profiilia";

/* Button or title */
"Run shortcut" = "Suorita oikotie";

/* Button or title to share a shortcut */
"Share Shortcut" = "Jaa oikotie";

/* Button or title to submit a shortcut to the gallery */
"Submit Shortcut" = "Lähetä oikotie";

/* Button or title; user profile */
"Profile" = "Profiili";

/* Button that shows all collection search results */
"See All" = "Näytä kaikki";

/* Button title on alert to discard changes to profile */
"Discard Changes" = "Hylkää muutokset";

/* Button title; create a new shortcut */
"Create Shortcut" = "Luo oikotie";

/* Button to add the Shortcuts Today Widget */
"Add Widget" = "Lisää widgetti";

/* Button to keep both shortcuts when you try to import a shortcut with the same name */
"Keep Both" = "Pidä molemmat";

/* Button to replace the older shortcut with the newer shortcut when you try to import a shortcut with the same name */
"Replace" = "Korvaa";

/* Button to skip a step */
"Skip" = "Ohita";

/* Configure which shortcuts should show up on the watch app */
"Choose shortcuts to show on your watch." = "Valitse kellossa näytettävät oikotiet.";

/* Configure which shortcuts should show up on the watch complication */
"Choose shortcuts to show in the Complication." = "Valitse komplikaatiossa näytettävät oikotiet.";

/* Copy content */
"Copy" = "Kopioi";

/* Could not find shortcut to run */
"Could not find the specified shortcut." = "Määritettyä oikotietä ei löytynyt.";

/* Could not find shortcut to run; %@=shortcut name */
"Could not find the shortcut “%@.”" = "Oikotietä ”%@” ei löytynyt.";

/* Default shortcut name to use if no name is provided */
"Untitled Shortcut" = "Nimetön oikotie";

/* Description of Siri feature on splash screen */
"Add any shortcut to Siri by recording a personalized voice phrase." = "Lisää mikä tahansa oikotie Siriin äänittämällä oma äänikomento.";

/* Description of intro feature on splash screen */
"Combine a series of steps into a single shortcut to automate what you do with your apps. " = "Yhdistä sarja vaiheita yhdeksi oikotieksi, jotta voit automatisoida apeilla tekemiäsi asioita. ";

/* Description of widget feature on splash screen */
"Access shortcuts even faster with the Shortcuts widget." = "Oikotiet-widgetin avulla oikotiet ovat käytettävissäsi entistäkin nopeammin.";

/* Edit profile photo; option to choose a photo from their iOS photo libary */
"Choose from Library" = "Valitse kirjastosta";

/* Edit profile photo; option to take a new photo to use */
"Take Photo" = "Ota kuva";

/* Edit profile; Twitter handle field placeholder */
"@WorkflowHQ" = "@WorkflowHQ";

/* Edit profile; email field placeholder */
"johnny@workflow.is" = "joni@workflow.is";

/* Edit profile; email field title */
"Email" = "Sähköposti";

/* Edit profile; error message for when the provided website is invalid */
"The website URL “%@” is not valid." = "Verkkosivun URL ”%@” on virheellinen.";

/* Edit profile; error title for when the provided website is invalid */
"Invalid Website" = "Virheellinen sivusto";

/* Edit profile; explanation to users on how their name will appear on published workflows; %@ = name, Twitter handle, or website */
"You will be credited as “%@” on your published workflows." = "Julkaistuissa työnkuluissa näyt käyttäjänä %@.";

/* Edit profile; person name field title */
"Name" = "Nimi";

/* Edit profile; person name field title (required) */
"Name (Required)" = "Nimi (vaaditaan)";

/* Edit profile; section header for private information (e.g. Email address) */
"Private Information" = "Yksityiset tiedot";

/* Edit profile; section header for public information (e.g. Twitter handle) */
"Public Information" = "Julkiset tiedot";

/* Edit profile; website field placeholder */
"www.workflow.is" = "www.workflow.is";

/* Empty state description when there are no search results; %@ = query */
"We didn’t turn up anything for “%@”. Try something else." = "Emme löytäneet tuloksia haulle ”%@”. Yritä jotain muuta.";

/* Empty state indicating that a user has no workflows */
"No shortcuts." = "Ei oikoteitä.";

/* Empty state title indicating no search results when searching for a workflow or collection in the gallery */
"No Results" = "Ei tuloksia";

/* Error alert body when importing a shortcut fails */
"The shortcut URL provided was invalid." = "Annettu oikotien URL oli virheellinen.";

/* Error alert title when importing a shortcut fails */
"Import Failed" = "Tuonti epäonnistui";

/* Error message */
"There are no photos in your photo library." = "Kuvakirjastossa ei ole kuvia.";

/* Error message description */
"The shortcut link may be invalid, or it may have been deleted." = "Oikotielinkki voi olla virheellinen tai se on voitu poistaa.";

/* Error message shown when the gallery does not load */
"Can’t connect to the Gallery." = "Galleriaan ei saada yhteyttä.";

/* Error message title */
"Shortcut Not Found" = "Oikotietä ei löytynyt";

/* Error message when a collection does not load */
"Couldn't load this collection." = "Tätä kokoelmaa ei voitu ladata.";

/* Error message when the collection fails to load */
"Couldn’t load this collection." = "Tätä kokoelmaa ei voitu ladata.";

/* Error presented to the user when an action times out while running (%@ = the name of the action) */
"The “%@” action took too long to finish running." = "Toiminnon ”%@” suorittaminen loppuun kesti liian kauan.";

/* Exit the app (kills the app) */
"Exit" = "Poistu";

/* Gallery search section title for collection search results */
"Collections" = "Kokoelmat";

/* Gallery search; button to show fewer collection search results */
"Show Less" = "Näytä vähemmän";

/* Gallery search; button to show more collection search results */
"Show More" = "Näytä lisää";

/* Generic title for a notification show in the app */
"Notification" = "Ilmoitus";

/* Guided tour; The “Shortcuts” part in the localized string “\n\nShortcuts are made of a series of actions (the items on the left).\n\nNext, let’s add a Make GIF action, which will animate the photos from the first action.”; used for highlighting */
"Shortcuts (Guided Tour)" = "Oikotiet";

/* Guided tour; The “actions” part in the localized string “\n\nShortcuts are made of a series of actions (the items on the left).\n\nNext, let’s add a Make GIF action, which will animate the photos from the first action.”; used for highlighting */
"actions" = "toimintoja";

/* Guided tour; Title for an alert that is shown along side an example shortcut */
"This is a shortcut." = "Tämä on oikotie.";

/* Guided tour; a happy title for an alert that is show when the user has created their first workflow */
"Congrats!" = "Onnittelut!";

/* Guided tour; a happy title for an alert that is shown after a user runs their first shortcut */
"Woot!" = "Oho!";

/* Guided tour; a more descriptive name for the play button; only used for accessibility */
"run shortcut button" = "suorita oikotie -painike";

/* Guided tour; let user know that they can drag an action from the actions pane from the left (on the right on RTL devices) to share the GIF */
"Drag over an action to share your GIF." = "Jaa GIF vetämällä toiminnon yli.";

/* Guided tour; run workflow button that looks like a classic play button (sideways triangle); should be the exact name that is used in the “\n\nYou just created a workflow. Now press the play button to run it!” localized string because it will be used to highlight the text */
"play button" = "toista-painike";

/* Guided tour; shown below “Aw no!” */
"\n\nSomething went wrong. Try again or tap Done." = "\n\nJokin meni vikaan. Yritä uudelleen tai napauta Valmis.";

/* Guided tour; shown below “Aw no!” */
"\n\nYou didn’t finish running the shortcut. Try again or tap Done." = "\n\nEt suorittanut oikotietä loppuun. Yritä uudelleen tai napauta Valmis.";

/* Guided tour; shown below “Congrats!” */
"\n\nYou just created a shortcut. Now press the play button to run it!" = "\n\nLoit oikotien. Suorita se nyt painamalla toistopainiketta!";

/* Guided tour; shown below “This is a shortcut.”; for RTL, left should be right */
"\n\nShortcuts are made of a series of actions (the items on the left).\n\nNext, let’s add a Make GIF action, which will animate the photos from the first action." = "\n\nOikotiet koostuvat sarjasta toimintoja (vasemmalla).\n\nLisätään seuraavaksi Tee GIF -toiminto, joka animoi ensimmäisen toiminnon kuvat.";

/* Guided tour; shown below “Welcome to Shortcuts” */
"\n\nLet’s build a shortcut to make an animated GIF." = "\n\nTehdään oikotie animoidulle GIFille.";

/* Guided tour; shown below “Woot!” */
"\n\nYou just ran a shortcut. Wasn’t that cool?" = "\n\nSuoritit juuri oikotien. Hienoa!";

/* Guided tour; welcome to shortcut title */
"Welcome to Shortcuts." = "Tervetuloa Oikoteihin.";

/* Information about what happens when a user submits a workflow to the gallery */
"By tapping “Submit”, your workflow will be submitted for review. If we decide to include your workflow in the Gallery, we’ll notify you by e-mail." = "Työnkulkusi lähetetään tarkistettavaksi, kun napautat Lähetä. Saat sähköpostia, jos Apple päättää sisällyttää työnkulkusi Galleriaan.";

/* Make GIF action name */
"Make GIF" = "Tee GIF";

/* Media file name label */
"Media File" = "Mediatiedosto";

/* Message of alert when a user tries to import a shortcut with the same name */
"Would you like to replace your shortcut?" = "Korvataanko oikotie?";

/* Navigation bar title for the form to fill out with the workflow’s information to submit to the gallery */
"Workflow Info" = "Työnkulun tiedot";

/* None option */
"None" = "Ei mitään";

/* Onboarding-flow; user already has widget */
"Great! It looks like you've already added the Shortcuts Widget. Let's keep going." = "Hienoa! Näyttää siltä, että olet jo lisännyt Oikotiet-widgetin. Jatketaan.";

/* Onboarding-flow; user does not have widget; text to convice user to get the widget */
"Run shortcuts crazy fast with the Shortcuts Widget." = "Suorita oikoteitä tosi nopeasti Oikotiet-widgetillä.";

/* Placeholder for the description field when submitting a workflow to the gallery */
"Please write a description of what your workflow does here." = "Kirjoita kuvaus, mitä työnkulku tekee tässä.";

/* Placeholder for the longer-form description field when submitting a workflow to the gallery */
"Please write a more detailed description of what your workflow does here." = "Kirjoita yksityiskohtaisempi kuvaus, mitä työnkulku tekee tässä.";

/* Placeholder for the name field in Edit Profile */
"Johnny Appleseed" = "Johnny Appleseed";

/* Placeholder for the short description field when submitting a workflow to the gallery */
"Please write a brief description of what your workflow does here." = "Kirjoita lyhyt kuvaus, mitä työnkulku tekee tässä.";

/* Print content */
"Print" = "Tulosta";

/* Quick Look action name */
"Quick Look" = "Pikakatsele";

/* Recovery option for when the gallery does not load */
"Try Again" = "Yritä uudelleen";

/* Recovery option for when the gallery does not load and the user should enable Wi-Fi, etc. in the Settings app */
"Open Settings" = "Avaa Asetukset";

/* Recovery suggestion for when the gallery does not load because there is no network connection */
"Turn on cellular data or use WLAN to access the Gallery." = "Käytä Galleriaa laittamalla mobiilidata päälle tai käyttämällä WLANia.";

/* Recovery suggestion for when the gallery does not load because there is no network connection */
"Turn on cellular data or use Wi-Fi to access the Gallery." = "Käytä Galleriaa laittamalla mobiilidata päälle tai käyttämällä Wi-Fiä.";

/* Recovery suggestion for when the gallery does not load because there is no network connection and the user has Airplane Mode enabled */
"Turn off Airplane Mode or use WLAN to access the Gallery." = "Galleria on käytettävissä, kun laitat lentokonetilan pois päältä tai käytät WLANia.";

/* Recovery suggestion for when the gallery does not load because there is no network connection and the user has Airplane Mode enabled */
"Turn off Airplane Mode or use Wi-Fi to access the Gallery." = "Galleria on käytettävissä, kun laitat lentokonetilan pois päältä tai käytät Wi-Fiä.";

/* Save as image */
"Save Image" = "Tallenna kuva";

/* Search gallery */
"Search" = "Etsi";

/* Section title */
"Shortcuts" = "Oikotiet";

/* Share via AirDrop */
"AirDrop" = "AirDrop";

/* Share via CloudApp */
"CloudApp" = "CloudApp";

/* Share via DeskConnect */
"DeskConnect" = "DeskConnect";

/* Share via Evernote */
"Evernote" = "Evernote";

/* Share via Facebook */
"Facebook" = "Facebook";

/* Share via Instagram */
"Instagram" = "Instagram";

/* Share via Instapaper */
"Instapaper" = "Instapaper";

/* Share via Mail */
"Mail" = "Mail";

/* Share via Messages */
"Message" = "Viesti";

/* Share via Pinboard */
"Pinboard" = "Pinboard";

/* Share via Pocket */
"Pocket" = "Pocket";

/* Share via Slack */
"Slack" = "Slack";

/* Shortcut has been submitted to the gallery */
"Shortcut Submitted" = "Oikotie lähetetty";

/* Shown in HUD after downloading a shortcut from the gallery */
"Added to Library" = "Lisätty kirjastoon";

/* Splash screen primary button title */
"Get Started" = "Aloita";

/* Splash screen title */
"Welcome to Shortcuts" = "Tervetuloa Oikoteihin";

/* Stop running the shortcut; %@=shortcut name */
"Stop %@" = "Lopeta %@";

/* Take Photo action name */
"Take Photo (action name)" = "Ota kuva";

/* Tap to choose an option */
"Tap to Choose" = "Valitse napauttamalla";

/* Terms and Conditions view title */
"Terms and Conditions" = "Käyttöehdot";

/* The user has submitted the shortcut to the gallery for approval and will be notified when it is approved to be included in the gallery */
"We’ll notify you when we approve it!" = "Ilmoitamme sinulle, kun hyväksymme sen!";

/* Title */
"Gallery" = "Galleria";

/* Title */
"Shortcuts" = "Oikotiet";

/* Title for button that is shown after the user submits a shortcut to the gallery to share their workflow. */
"Spread the Word" = "Kerro muillekin";

/* Title for the description field when submitting a workflow to the gallery */
"Description" = "Kuvaus";

/* Title for the longer-form description field when submitting a workflow to the gallery */
"Long Description" = "Pitkä kuvaus";

/* Title for the short description field when submitting a workflow to the gallery */
"Short Description" = "Lyhyt kuvaus";

/* Title for workflow name field when submitting a workflow to the gallery */
"Workflow Name" = "Työnkulun nimi";

/* Title of Siri feature on splash screen */
"Just Ask Siri" = "Kysy Siriltä";

/* Title of alert encouraging users to add the Shortcuts widget after they have tried to skip adding the widget. */
"Add the Widget?" = "Lisätäänkö widgetti?";

/* Title of alert when a user tries to import a shortcut with the same name; %@ = shortcut name */
"You already have a shortcut named “%@”." = "Oikotie nimeltä ”%@” on jo olemassa.";

/* Title of alert when the user’s gallery submission didn’t go through due to an error */
"Uh Oh" = "Voi ei!";

/* Title of intro feature on splash screen */
"Take the Shortest Path" = "Valitse lyhyin polku";

/* Title of main screen showing your library of shortcuts */
"Library" = "Kirjasto";

/* Title of widget feature on splash screen */
"Shortcuts Widget" = "Oikotiet-widgetti";

/* Title; shortcuts database on device is corrupt */
"Corrupt Database" = "Vioittunut tietokanta";

/* Today Widget; button to view the shortcut gallery */
"View the Gallery…" = "Näytä Galleria…";

/* Today widget button; manage shortcuts that appear in the today widget */
"Manage Shortcuts…" = "Hallitse oikoteitä…";

/* Today widget button; manage workflows that appear in the today widget */
"Customize in Shortcuts" = "Muokkaa Oikoteissä";

/* Today widget walkthough; user found widget and should add it */
"You found the widget! Tap *Add Widget* to access this from anywhere." = "Löysit widgetin! Pääset siihen mistä tahansa napauttamalla *Lisää widgetti*.";

/* Today widget walkthough; user found widget and should come back here */
"You found the widget! Come back here to run your shortcuts quickly." = "Löysit widgetin! Voit suorittaa oikotiesi nopeasti palaamalla tänne.";

/* Today widget; empty state */
"No Shortcuts" = "Ei oikoteitä";

/* Today widget; see the rest of the shortcuts in the widget */
"Tap to see the rest" = "Näet loput napauttamalla";

/* Twitter handle label or share via Twitter */
"Twitter" = "Twitter";

/* Waiting for the gallery to load. Shown under loading indicator */
"Loading" = "Ladataan";

/* Watch app button; stop running the shortcut */
"Stop" = "Lopeta";

/* Watch app, title for switch to show and hide a shortcut */
"Show/Hide" = "Näytä/kätke";

/* Watch app; Change text field text */
"Tap to Change" = "Muuta napauttamalla";

/* Watch app; Compose a message */
"Create Message" = "Luo viesti";

/* Watch app; Plus/Minus button name for number pad */
"Plus/Minus" = "plus, miinus";

/* Watch app; Shown under a title of an article; %@=author of article */
"by %@" = "%@";

/* Watch app; email composer, email address from which to send the mail */
"From Address" = "Osoitteesta";

/* Watch app; email composer; bcc address label */
"Bcc" = "Piilokopio";

/* Watch app; email composer; cc address label */
"Cc" = "Kopio";

/* Watch app; email composer; from address label */
"From" = "Lähettäjä";

/* Watch app; email composer; indicates files are attached; %@=number of files attached */
"Attached (%ld)" = "Liitetty (%ld)";

/* Watch app; email composer; subject label */
"Subject" = "Aihe";

/* Watch app; email composer; to address label */
"To" = "Vastaanottaja";

/* Watch app; location could not be determined for an address */
"Location Not Found" = "Sijaintia ei löytynyt";

/* Watch app; mail compoer cc/bcc field label */
"Cc/Bcc" = "Kopio/piilokopio";

/* Watch app; number field placeholder */
"Enter number…" = "Syötä numero…";

/* Watch app; send message error message */
"You must choose a contact to send a message to." = "Valitse yhteyshenkilö, jolle viesti lähetetään.";

/* Watch app; send the email */
"Send" = "Lähetä";

/* Watch app; share QuickLook content */
"Share" = "Jaa";

/* Watch app; shown when user needs to allow access to a certain resource such as Photo Library access; %@=shortcut name */
"Use Handoff on your iPhone to allow access for %@." = "Käyttämällä iPhonen Handoffia voit sallia käyttöoikeuden oikotielle %@.";

/* Watch app; tell user that they can use the Handoff feature to continue running the rest of the shortcut on their phone */
"Use Handoff on your iPhone to continue the shortcut." = "Käyttämällä iPhonen Handoffia voit jatkaa oikotietä.";

/* Watch app; text field placeholder */
"Enter text…" = "Syötä tekstiä…";

/* Watch app; view current content on the phone */
"View on iPhone" = "Katso iPhonessa";

/* Watch complication; no shortcuts have been added (modular large complication) */
"No shortcuts have been added." = "Yhtään oikotietä ei ole lisätty.";

/* Watch complication; no shortcuts have been added (utilitarian small complication, text should be short) */
"No Shortcuts (Short)" = "Ei oikoteitä";

/* Website URL label */
"Website" = "Verkkosivu";

/* Widget tutorial headline; how to add Today Widget */
"Adding the Widget" = "Widgetin lisääminen";

/* Widget tutorial; accessiblity description */
"An animation of pressing firmly on the Shortcuts home screen icon to open the widget" = "Animaatio widgetin avaamisesta painamalla Oikotiet-kuvaketta voimakkaasti Koti-valikossa";

/* Widget tutorial; how to add Today Widget */
"Tap + to add the Shortcuts Widget. Tap “Done.”" = "Lisää Oikotiet-widgetti napauttamalla +. Napauta ”Valmis”.";

/* Widget tutorial; how to add Today Widget on devices that don’t have a home button on iOS 10 and above */
"Swipe up to go home, press firmly on the Shortcuts icon, and tap “Add Widget.”" = "Siirry Koti-valikkoon pyyhkäisemällä ylös, paina Oikotiet-kuvaketta voimakkaasti ja napauta ”Lisää widgetti”.";

/* Widget tutorial; how to add Today Widget on devices that have a home button on iOS 10 and above */
"Press the Home button, press firmly on the Shortcuts icon, and tap “Add Widget.”" = "Paina Koti-painiketta, paina Oikotiet-kuvaketta voimakkaasti ja napauta ”Lisää widgetti”.";

/* Widget tutorial; how to add Today Widget on iOS 10, iPad and iPhone, non-3D Touch, iOS 8 and 9 step 3 */
"Scroll to the bottom and\ntap “Edit.”" = "Vieritä alas ja napauta\nMuokkaa.";

/* Widget tutorial; how to add Today Widget on iOS 8 and 9 & iOS 10, iPad and iPhone, non-3D Touch step 2 */
"Swipe to the left to view\nyour widgets." = "Näet widgettisi\npyyhkäisemällä vasemmalle.";

/* Widget tutorial; how to add Today Widget on iOS 8 and 9, iPad step 2 */
"On the lower left, scroll\ndown and tap “Edit.”" = "Alavasemmalla, vieritä\nalas ja napauta Muokkaa.";

/* Widget tutorial; how to add Today Widget step 1 */
"Swipe down from the top to reveal Notification Center." = "Näet Ilmoituskeskuksen pyyhkäisemällä ylhäältä alaspäin.";

/* Your shortcut is ready to share as a link */
"Your shortcut is ready to share!" = "Oikotie on valmis jaettavaksi!";

/* date range; $@=time until; appended to date with time (e.g. Today 5pm to 6pm); please include space for relevant languages */
" to %@" = " – %@";

/* date range; %1$@ = start date; %2$@ = end date */
"%1$@ to %2$@" = "%1$@ – %2$@";

/* opposite of “left”; should be “left” for RTL languages */
"right" = "oikea";

